def flat(X, stat_dim=0, end_dim=1):
    return X.flatten(start_dim=0, end_dim=1)

import random

starts = " \n\x1e\"\'(.।॥"
stems = ['वि', 'इत', 'न ', 'च ', 'तत', 'वा', 'पर', 'सम', 'प्र', 'स्व', 'सर्', 'तत्', 'प्रत', 'सर्व', 'तत्र', 'धर्म', 'ज्ञा', 'तस्य', 'व्या', 'स्वा', 'भवति', 'तस्म', 'प्रम', 'कर्म', 'पूर्', 'यथा ', 'प्रति', 'तत्र ', 'स्यात', 'भवति ', 'पूर्व', 'ज्ञान', 'प्रमा', 'तस्मा', 'ब्रह्', 'दृष्ट', 'स्वाह', 'तस्य ', 'न्याय', 'विशेष', 'नास्त', 'प्रत्य', 'स्यात्', 'ब्रह्म', 'स्वाहा', 'प्रमाण', 'अनुव्य', "श्वर", "भगव", "महा", "देव", "नाराय", "परम", "पुरुष", "जग", "चक्रवर्ति", "महाराज", "ब्राह्म", "क्षत्रि", "हिमाल", "समु", "भारत", "त्रैल", "संव", "युग", "वेद", "अष्ट", "धर्म", "पुर", "इति", "राम", "भरत"]

def random_init():
    return random.choice(starts) + random.choice(stems)    